import { Message } from '../components';

const message = 'Бла блаааа Бла блаааа Бла блаааа Бла блаааа'
  + ' Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа'
  + ' Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа'
  + ' Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа'
  + ' Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа'
  + ' Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа'
  + ' Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа'
  + ' Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа '
  + 'Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа'
  + ' Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа'
  + ' Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа '
  + 'Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа '
  + 'Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа'
  + ' Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа '
  + 'Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла'
  + ' блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа Бла блаааа'
  + ' Бла блаааа Бла блаааа Бла блаааа';

const data = {
  message,
  date: '12:12',
};

export const MESSAGES = [
  new Message({ ...data, isOutgoing: true }),
  new Message({ ...data }),
  new Message({ ...data, isOutgoing: true }),
  new Message({ ...data, isOutgoing: true }),
  new Message({ ...data }),
  new Message({ ...data, isOutgoing: true }),
  new Message({ ...data }),
];
